[Killed] BlockStatement
src/services/CheckoutService.js:4:65
 const { CircuitBreaker } = require('../utils/CircuitBreaker');
 
 class CheckoutService {
-  constructor(gatewayPagamento, pedidoRepository, emailService) {
-    this.gatewayPagamento = gatewayPagamento;
-    this.pedidoRepository = pedidoRepository;
-    this.emailService = emailService;
-    this.circuitBreaker = new CircuitBreaker({
-      failureThreshold: 0.5,
-      resetTimeout: 30000,
-      minCalls: 10
-    });
-    this.maxRetries = 3;
-    this.retryDelay = 500; // ms
-    this.timeout = 2000; // ms
-  }
+  constructor(gatewayPagamento, pedidoRepository, emailService) {}
 
   async processar(pedido) {
killedBy: CheckoutService Caminho Feliz - Pagamento Aprovado deve processar pedido com sucesso e enviar e-mail
statusReason: TypeError: Cannot read properties of undefined (reading 'salvar')

[Survived] ObjectLiteral
src/services/CheckoutService.js:8:46
     this.gatewayPagamento = gatewayPagamento;
     this.pedidoRepository = pedidoRepository;
     this.emailService = emailService;
-    this.circuitBreaker = new CircuitBreaker({
-      failureThreshold: 0.5,
-      resetTimeout: 30000,
-      minCalls: 10
-    });
+    this.circuitBreaker = new CircuitBreaker({});
     this.maxRetries = 3;
     this.retryDelay = 500; // ms

[Killed] ConditionalExpression
src/services/CheckoutService.js:20:9
 
   async processar(pedido) {
     const validationError = this._validarPedido(pedido);
-    if (validationError) {
+    if (false) {
       throw new Error(validationError);
     }
killedBy: CheckoutService Validação de Entrada deve rejeitar pedido sem email
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] BlockStatement
src/services/CheckoutService.js:20:26
 
   async processar(pedido) {
     const validationError = this._validarPedido(pedido);
-    if (validationError) {
-      throw new Error(validationError);
-    }
+    if (validationError) {}
 
     let lastError = null;
killedBy: CheckoutService Validação de Entrada deve rejeitar pedido sem email
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] ConditionalExpression
src/services/CheckoutService.js:27:27
     let lastError = null;
     let gatewayResponse = null;
 
-    for (let attempt = 0; attempt <= this.maxRetries; attempt++) {
+    for (let attempt = 0; false; attempt++) {
       try {
         if (attempt > 0) {
killedBy: CheckoutService Caminho Feliz - Pagamento Aprovado deve processar pedido com sucesso e enviar e-mail
statusReason: TypeError: Cannot read properties of null (reading 'status')

[Killed] EqualityOperator
src/services/CheckoutService.js:27:27
     let lastError = null;
     let gatewayResponse = null;
 
-    for (let attempt = 0; attempt <= this.maxRetries; attempt++) {
+    for (let attempt = 0; attempt < this.maxRetries; attempt++) {
       try {
         if (attempt > 0) {
killedBy: CheckoutService Resiliência - Timeout e Retry deve esgotar retentativas e ativar fallback
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 4
Received number of calls: 3

[Killed] BlockStatement
src/services/CheckoutService.js:28:11
     let gatewayResponse = null;
 
     for (let attempt = 0; attempt <= this.maxRetries; attempt++) {
-      try {
-        if (attempt > 0) {
-          console.log(`Tentativa ${attempt + 1}/${this.maxRetries + 1}...`);
-          await this._delay(this.retryDelay * attempt);
-        }
-
-        gatewayResponse = await this.circuitBreaker.execute(() => 
-          this._cobrarComTimeout(pedido)
-        );
-        
-        break;
-      } catch (error) {
+      try {} catch (error) {
         lastError = error;
         console.error(`Tentativa ${attempt + 1} falhou: ${error.message}`);
killedBy: CheckoutService Caminho Feliz - Pagamento Aprovado deve processar pedido com sucesso e enviar e-mail
statusReason: TypeError: Cannot read properties of null (reading 'status')

[Killed] ConditionalExpression
src/services/CheckoutService.js:29:13
 
     for (let attempt = 0; attempt <= this.maxRetries; attempt++) {
       try {
-        if (attempt > 0) {
+        if (true) {
           console.log(`Tentativa ${attempt + 1}/${this.maxRetries + 1}...`);
           await this._delay(this.retryDelay * attempt);
killedBy: CheckoutService Resiliência - Timeout e Retry deve executar o delay progressivo correto a cada retry que falha
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 3

[Killed] ConditionalExpression
src/services/CheckoutService.js:29:13
 
     for (let attempt = 0; attempt <= this.maxRetries; attempt++) {
       try {
-        if (attempt > 0) {
+        if (false) {
           console.log(`Tentativa ${attempt + 1}/${this.maxRetries + 1}...`);
           await this._delay(this.retryDelay * attempt);
killedBy: CheckoutService Resiliência - Timeout e Retry deve executar o delay progressivo correto a cada retry que falha
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Survived] ArithmeticOperator
src/services/CheckoutService.js:30:36
     for (let attempt = 0; attempt <= this.maxRetries; attempt++) {
       try {
         if (attempt > 0) {
-          console.log(`Tentativa ${attempt + 1}/${this.maxRetries + 1}...`);
+          console.log(`Tentativa ${attempt - 1}/${this.maxRetries + 1}...`);
           await this._delay(this.retryDelay * attempt);
         }

[Survived] ArithmeticOperator
src/services/CheckoutService.js:30:51
     for (let attempt = 0; attempt <= this.maxRetries; attempt++) {
       try {
         if (attempt > 0) {
-          console.log(`Tentativa ${attempt + 1}/${this.maxRetries + 1}...`);
+          console.log(`Tentativa ${attempt + 1}/${this.maxRetries - 1}...`);
           await this._delay(this.retryDelay * attempt);
         }

[Killed] ArithmeticOperator
src/services/CheckoutService.js:31:29
       try {
         if (attempt > 0) {
           console.log(`Tentativa ${attempt + 1}/${this.maxRetries + 1}...`);
-          await this._delay(this.retryDelay * attempt);
+          await this._delay(this.retryDelay / attempt);
         }
 
killedBy: CheckoutService Resiliência - Timeout e Retry deve executar o delay progressivo correto a cada retry que falha
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 2
Expected: 1000
Received
       1: 500
->     2: 250

[Killed] ArrowFunction
src/services/CheckoutService.js:34:61
           await this._delay(this.retryDelay * attempt);
         }
 
-        gatewayResponse = await this.circuitBreaker.execute(() => 
-          this._cobrarComTimeout(pedido)
+        gatewayResponse = await this.circuitBreaker.execute(() => undefined
         );
         
killedBy: CheckoutService Caminho Feliz - Pagamento Aprovado deve processar pedido com sucesso e enviar e-mail
statusReason: TypeError: Cannot read properties of null (reading 'status')

[Killed] BlockStatement
src/services/CheckoutService.js:39:23
         );
         
         break;
-      } catch (error) {
-        lastError = error;
-        console.error(`Tentativa ${attempt + 1} falhou: ${error.message}`);
-        
-        if (error.message === 'Circuit is open') {
-          break; 
-        }
-      }
+      } catch (error) {}
     }
 
killedBy: CheckoutService Circuit Breaker deve abrir o disjuntor após atingir os critérios de falha mínimos
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] ArithmeticOperator
src/services/CheckoutService.js:41:36
         break;
       } catch (error) {
         lastError = error;
-        console.error(`Tentativa ${attempt + 1} falhou: ${error.message}`);
+        console.error(`Tentativa ${attempt - 1} falhou: ${error.message}`);
         
         if (error.message === 'Circuit is open') {

[Killed] EqualityOperator
src/services/CheckoutService.js:43:13
         lastError = error;
         console.error(`Tentativa ${attempt + 1} falhou: ${error.message}`);
         
-        if (error.message === 'Circuit is open') {
+        if (error.message !== 'Circuit is open') {
           break; 
         }
killedBy: CheckoutService Resiliência - Timeout e Retry deve tentar novamente após timeout e recuperar na 2ª tentativa
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] ConditionalExpression
src/services/CheckoutService.js:43:13
         lastError = error;
         console.error(`Tentativa ${attempt + 1} falhou: ${error.message}`);
         
-        if (error.message === 'Circuit is open') {
+        if (true) {
           break; 
         }
killedBy: CheckoutService Resiliência - Timeout e Retry deve tentar novamente após timeout e recuperar na 2ª tentativa
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] ConditionalExpression
src/services/CheckoutService.js:49:9
       }
     }
 
-    if (gatewayResponse) {
+    if (true) {
       if (gatewayResponse.status === 'APROVADO') {
         return await this._processarAprovado(pedido);
killedBy: CheckoutService Resiliência - Timeout e Retry deve esgotar retentativas e ativar fallback
statusReason: TypeError: Cannot read properties of null (reading 'status')

[Killed] ConditionalExpression
src/services/CheckoutService.js:49:9
       }
     }
 
-    if (gatewayResponse) {
+    if (false) {
       if (gatewayResponse.status === 'APROVADO') {
         return await this._processarAprovado(pedido);
killedBy: CheckoutService Caminho Feliz - Pagamento Aprovado deve processar pedido com sucesso e enviar e-mail
statusReason: TypeError: Cannot read properties of null (reading 'status')

[Killed] BlockStatement
src/services/CheckoutService.js:50:50
     }
 
     if (gatewayResponse) {
-      if (gatewayResponse.status === 'APROVADO') {
-        return await this._processarAprovado(pedido);
-      } else {
+      if (gatewayResponse.status === 'APROVADO') {} else {
         return await this._processarRecusado(pedido);
       }
killedBy: CheckoutService Caminho Feliz - Pagamento Aprovado deve processar pedido com sucesso e enviar e-mail
statusReason: TypeError: Cannot read properties of null (reading 'status')

[Killed] ConditionalExpression
src/services/CheckoutService.js:50:11
     }
 
     if (gatewayResponse) {
-      if (gatewayResponse.status === 'APROVADO') {
+      if (true) {
         return await this._processarAprovado(pedido);
       } else {
killedBy: CheckoutService Caminho Infeliz - Pagamento Recusado deve marcar pedido como FALHOU e não enviar e-mail
statusReason: Error: expect(received).toBeNull()

Received: {"cartao": {"cvv": "123", "numero": "4111111111111111", "validade": "12/26"}, "clienteEmail": "cliente@teste.com", "status": "PROCESSADO", "valor": 150}

[Killed] BlockStatement
src/services/CheckoutService.js:52:14
     if (gatewayResponse) {
       if (gatewayResponse.status === 'APROVADO') {
         return await this._processarAprovado(pedido);
-      } else {
-        return await this._processarRecusado(pedido);
-      }
+      } else {}
     }
 
killedBy: CheckoutService Caminho Infeliz - Pagamento Recusado deve marcar pedido como FALHOU e não enviar e-mail
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "FALHOU"}
Received: {"cartao": {"cvv": "123", "numero": "4111111111111111", "validade": "12/26"}, "clienteEmail": "cliente@teste.com", "status": "ERRO_GATEWAY", "valor": 150}

Number of calls: 1

[Killed] BlockStatement
src/services/CheckoutService.js:60:35
     return await this._fallback(pedido);
   }
 
-  async _cobrarComTimeout(pedido) {
-    return Promise.race([
-      this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao),
-      new Promise((_, reject) =>
-        setTimeout(() => reject(new Error('Timeout no gateway de pagamento')), this.timeout)
-      )
-    ]);
-  }
+  async _cobrarComTimeout(pedido) {}
 
   async _processarAprovado(pedido) {
killedBy: CheckoutService Caminho Feliz - Pagamento Aprovado deve processar pedido com sucesso e enviar e-mail
statusReason: TypeError: Cannot read properties of null (reading 'status')

[Timeout] ArrayDeclaration
src/services/CheckoutService.js:61:25
   }
 
   async _cobrarComTimeout(pedido) {
-    return Promise.race([
-      this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao),
-      new Promise((_, reject) =>
-        setTimeout(() => reject(new Error('Timeout no gateway de pagamento')), this.timeout)
-      )
-    ]);
+    return Promise.race([]);
   }
 

[Survived] ArrowFunction
src/services/CheckoutService.js:63:19
   async _cobrarComTimeout(pedido) {
     return Promise.race([
       this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao),
-      new Promise((_, reject) =>
-        setTimeout(() => reject(new Error('Timeout no gateway de pagamento')), this.timeout)
+      new Promise(() => undefined
       )
     ]);

[Survived] ArrowFunction
src/services/CheckoutService.js:64:20
     return Promise.race([
       this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao),
       new Promise((_, reject) =>
-        setTimeout(() => reject(new Error('Timeout no gateway de pagamento')), this.timeout)
+        setTimeout(() => undefined, this.timeout)
       )
     ]);

[Killed] BlockStatement
src/services/CheckoutService.js:69:36
     ]);
   }
 
-  async _processarAprovado(pedido) {
-    pedido.status = 'PROCESSADO';
-    const pedidoSalvo = await this.pedidoRepository.salvar(pedido);
-    
-    this._enviarEmailAssincrono(pedido.clienteEmail, 'Pagamento Aprovado');
-    
-    return pedidoSalvo;
-  }
+  async _processarAprovado(pedido) {}
 
   async _processarRecusado(pedido) {
killedBy: CheckoutService Caminho Feliz - Pagamento Aprovado deve processar pedido com sucesso e enviar e-mail
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] StringLiteral
src/services/CheckoutService.js:73:54
     pedido.status = 'PROCESSADO';
     const pedidoSalvo = await this.pedidoRepository.salvar(pedido);
     
-    this._enviarEmailAssincrono(pedido.clienteEmail, 'Pagamento Aprovado');
+    this._enviarEmailAssincrono(pedido.clienteEmail, "");
     
     return pedidoSalvo;
killedBy: CheckoutService Caminho Feliz - Pagamento Aprovado deve processar pedido com sucesso e enviar e-mail
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "cliente@teste.com", "Pagamento Aprovado"
Received: "cliente@teste.com", ""

Number of calls: 1

[Killed] BlockStatement
src/services/CheckoutService.js:78:36
     return pedidoSalvo;
   }
 
-  async _processarRecusado(pedido) {
-    pedido.status = 'FALHOU';
-    await this.pedidoRepository.salvar(pedido);
-    return null;
-  }
+  async _processarRecusado(pedido) {}
 
   async _fallback(pedido) {
killedBy: CheckoutService Caminho Infeliz - Pagamento Recusado deve marcar pedido como FALHOU e não enviar e-mail
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] BlockStatement
src/services/CheckoutService.js:84:27
     return null;
   }
 
-  async _fallback(pedido) {
-    console.warn('Fallback para pedido', pedido.clienteEmail);
-    
-    pedido.status = 'ERRO_GATEWAY';
-    await this.pedidoRepository.salvar(pedido);
-    
-    return null;
-  }
+  async _fallback(pedido) {}
 
   _enviarEmailAssincrono(email, message) {
killedBy: CheckoutService Resiliência - Timeout e Retry deve esgotar retentativas e ativar fallback
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Survived] StringLiteral
src/services/CheckoutService.js:85:18
   }
 
   async _fallback(pedido) {
-    console.warn('Fallback para pedido', pedido.clienteEmail);
+    console.warn("", pedido.clienteEmail);
     
     pedido.status = 'ERRO_GATEWAY';

[Killed] BlockStatement
src/services/CheckoutService.js:93:42
     return null;
   }
 
-  _enviarEmailAssincrono(email, message) {
-    this.emailService.enviarConfirmacao(email, message)
-      .then(() => console.log(`E-mail enviado para ${email}`))
-      .catch(err => console.error(`Falha ao enviar e-mail para ${email}:`, err.message));
-  }
+  _enviarEmailAssincrono(email, message) {}
 
   _validarPedido(pedido) {
killedBy: CheckoutService Caminho Feliz - Pagamento Aprovado deve processar pedido com sucesso e enviar e-mail
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "cliente@teste.com", "Pagamento Aprovado"

Number of calls: 0

[Survived] ArrowFunction
src/services/CheckoutService.js:95:13
 
   _enviarEmailAssincrono(email, message) {
     this.emailService.enviarConfirmacao(email, message)
-      .then(() => console.log(`E-mail enviado para ${email}`))
+      .then(() => undefined)
       .catch(err => console.error(`Falha ao enviar e-mail para ${email}:`, err.message));
   }

[Survived] ArrowFunction
src/services/CheckoutService.js:96:14
   _enviarEmailAssincrono(email, message) {
     this.emailService.enviarConfirmacao(email, message)
       .then(() => console.log(`E-mail enviado para ${email}`))
-      .catch(err => console.error(`Falha ao enviar e-mail para ${email}:`, err.message));
+      .catch(() => undefined);
   }
 

[Killed] BlockStatement
src/services/CheckoutService.js:99:26
       .catch(err => console.error(`Falha ao enviar e-mail para ${email}:`, err.message));
   }
 
-  _validarPedido(pedido) {
-    if (!pedido.clienteEmail || !this._isEmailValido(pedido.clienteEmail)) {
-      return 'Email inválido ou ausente';
-    }
-    if (!pedido.valor || pedido.valor <= 0) {
-      return 'Valor deve ser maior que zero';
-    }
-    if (!pedido.cartao || !pedido.cartao.numero || !pedido.cartao.validade || !pedido.cartao.cvv) {
-      return 'Dados do cartão incompletos';
-    }
-    return null;
-  }
+  _validarPedido(pedido) {}
 
   _isEmailValido(email) {
killedBy: CheckoutService Validação de Entrada deve rejeitar pedido sem email
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] BooleanLiteral
src/services/CheckoutService.js:100:33
   }
 
   _validarPedido(pedido) {
-    if (!pedido.clienteEmail || !this._isEmailValido(pedido.clienteEmail)) {
+    if (!pedido.clienteEmail || this._isEmailValido(pedido.clienteEmail)) {
       return 'Email inválido ou ausente';
     }
killedBy: CheckoutService Caminho Feliz - Pagamento Aprovado deve processar pedido com sucesso e enviar e-mail
statusReason: Error: Email inválido ou ausente

[Killed] ConditionalExpression
src/services/CheckoutService.js:100:9
   }
 
   _validarPedido(pedido) {
-    if (!pedido.clienteEmail || !this._isEmailValido(pedido.clienteEmail)) {
+    if (false) {
       return 'Email inválido ou ausente';
     }
killedBy: CheckoutService Validação de Entrada deve rejeitar pedido sem email
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] BlockStatement
src/services/CheckoutService.js:103:45
     if (!pedido.clienteEmail || !this._isEmailValido(pedido.clienteEmail)) {
       return 'Email inválido ou ausente';
     }
-    if (!pedido.valor || pedido.valor <= 0) {
-      return 'Valor deve ser maior que zero';
-    }
+    if (!pedido.valor || pedido.valor <= 0) {}
     if (!pedido.cartao || !pedido.cartao.numero || !pedido.cartao.validade || !pedido.cartao.cvv) {
       return 'Dados do cartão incompletos';
killedBy: CheckoutService Validação de Entrada deve rejeitar pedido com valor exatamente igual a zero
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] LogicalOperator
src/services/CheckoutService.js:103:9
     if (!pedido.clienteEmail || !this._isEmailValido(pedido.clienteEmail)) {
       return 'Email inválido ou ausente';
     }
-    if (!pedido.valor || pedido.valor <= 0) {
+    if (!pedido.valor && pedido.valor <= 0) {
       return 'Valor deve ser maior que zero';
     }
killedBy: CheckoutService Validação de Entrada deve rejeitar pedido com valor negativo
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] LogicalOperator
src/services/CheckoutService.js:106:9
     if (!pedido.valor || pedido.valor <= 0) {
       return 'Valor deve ser maior que zero';
     }
-    if (!pedido.cartao || !pedido.cartao.numero || !pedido.cartao.validade || !pedido.cartao.cvv) {
+    if ((!pedido.cartao || !pedido.cartao.numero) && !pedido.cartao.validade || !pedido.cartao.cvv) {
       return 'Dados do cartão incompletos';
     }
killedBy: CheckoutService Validação de Entrada deve rejeitar pedido se o número do cartão estiver ausente
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] LogicalOperator
src/services/CheckoutService.js:106:9
     if (!pedido.valor || pedido.valor <= 0) {
       return 'Valor deve ser maior que zero';
     }
-    if (!pedido.cartao || !pedido.cartao.numero || !pedido.cartao.validade || !pedido.cartao.cvv) {
+    if (!pedido.cartao && !pedido.cartao.numero || !pedido.cartao.validade || !pedido.cartao.cvv) {
       return 'Dados do cartão incompletos';
     }
killedBy: CheckoutService Validação de Entrada deve rejeitar pedido se o número do cartão estiver ausente
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] BlockStatement
src/services/CheckoutService.js:112:25
     return null;
   }
 
-  _isEmailValido(email) {
-    const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-    return re.test(email);
-  }
+  _isEmailValido(email) {}
 
   _delay(ms) {
killedBy: CheckoutService Caminho Feliz - Pagamento Aprovado deve processar pedido com sucesso e enviar e-mail
statusReason: Error: Email inválido ou ausente

[Killed] Regex
src/services/CheckoutService.js:113:16
   }
 
   _isEmailValido(email) {
-    const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+    const re = /^[^\s@]+@[\s@]+\.[^\s@]+$/;
     return re.test(email);
   }
killedBy: CheckoutService Caminho Feliz - Pagamento Aprovado deve processar pedido com sucesso e enviar e-mail
statusReason: Error: Email inválido ou ausente

[Killed] Regex
src/services/CheckoutService.js:113:16
   }
 
   _isEmailValido(email) {
-    const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+    const re = /[^\s@]+@[^\s@]+\.[^\s@]+$/;
     return re.test(email);
   }
killedBy: CheckoutService Validação de Entrada deve rejeitar e-mails com formatos maliciosos
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Survived] BlockStatement
src/services/CheckoutService.js:117:14
     return re.test(email);
   }
 
-  _delay(ms) {
-    return new Promise(resolve => setTimeout(resolve, ms));
-  }
+  _delay(ms) {}
 }
 

[Timeout] ArrowFunction
src/services/CheckoutService.js:118:24
   }
 
   _delay(ms) {
-    return new Promise(resolve => setTimeout(resolve, ms));
+    return new Promise(() => undefined);
   }
 }
