[Killed] BlockStatement
src/utils/CircuitBreaker.js:3:23
 // src/utils/CircuitBreaker.js
 class CircuitBreaker {
-  constructor(config) {
-    this.failureThreshold = config.failureThreshold || 0.5;
-    this.resetTimeout = config.resetTimeout || 30000;
-    this.minCalls = config.minCalls || 10;
-    this.state = 'CLOSED'; // CLOSED, OPEN, HALF-OPEN
-  }
+  constructor(config) {}
 
   async execute(fn) {
killedBy: CheckoutService Circuit Breaker deve carregar as configurações customizadas passadas no construtor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.3
Received: undefined

[Killed] LogicalOperator
src/utils/CircuitBreaker.js:4:29
 // src/utils/CircuitBreaker.js
 class CircuitBreaker {
   constructor(config) {
-    this.failureThreshold = config.failureThreshold || 0.5;
+    this.failureThreshold = config.failureThreshold && 0.5;
     this.resetTimeout = config.resetTimeout || 30000;
     this.minCalls = config.minCalls || 10;
killedBy: CheckoutService Circuit Breaker deve carregar as configurações customizadas passadas no construtor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.3
Received: 0.5

[Killed] ConditionalExpression
src/utils/CircuitBreaker.js:4:29
 // src/utils/CircuitBreaker.js
 class CircuitBreaker {
   constructor(config) {
-    this.failureThreshold = config.failureThreshold || 0.5;
+    this.failureThreshold = true;
     this.resetTimeout = config.resetTimeout || 30000;
     this.minCalls = config.minCalls || 10;
killedBy: CheckoutService Circuit Breaker deve carregar as configurações customizadas passadas no construtor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.3
Received: true

[Killed] LogicalOperator
src/utils/CircuitBreaker.js:5:25
 class CircuitBreaker {
   constructor(config) {
     this.failureThreshold = config.failureThreshold || 0.5;
-    this.resetTimeout = config.resetTimeout || 30000;
+    this.resetTimeout = config.resetTimeout && 30000;
     this.minCalls = config.minCalls || 10;
     this.state = 'CLOSED'; // CLOSED, OPEN, HALF-OPEN
killedBy: CheckoutService Circuit Breaker deve carregar as configurações customizadas passadas no construtor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10000
Received: 30000

[Killed] ConditionalExpression
src/utils/CircuitBreaker.js:5:25
 class CircuitBreaker {
   constructor(config) {
     this.failureThreshold = config.failureThreshold || 0.5;
-    this.resetTimeout = config.resetTimeout || 30000;
+    this.resetTimeout = true;
     this.minCalls = config.minCalls || 10;
     this.state = 'CLOSED'; // CLOSED, OPEN, HALF-OPEN
killedBy: CheckoutService Circuit Breaker deve carregar as configurações customizadas passadas no construtor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10000
Received: true

[Killed] ConditionalExpression
src/utils/CircuitBreaker.js:6:21
   constructor(config) {
     this.failureThreshold = config.failureThreshold || 0.5;
     this.resetTimeout = config.resetTimeout || 30000;
-    this.minCalls = config.minCalls || 10;
+    this.minCalls = false;
     this.state = 'CLOSED'; // CLOSED, OPEN, HALF-OPEN
   }
killedBy: CheckoutService Circuit Breaker deve carregar as configurações customizadas passadas no construtor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: false

[Killed] LogicalOperator
src/utils/CircuitBreaker.js:6:21
   constructor(config) {
     this.failureThreshold = config.failureThreshold || 0.5;
     this.resetTimeout = config.resetTimeout || 30000;
-    this.minCalls = config.minCalls || 10;
+    this.minCalls = config.minCalls && 10;
     this.state = 'CLOSED'; // CLOSED, OPEN, HALF-OPEN
   }
killedBy: CheckoutService Circuit Breaker deve carregar as configurações customizadas passadas no construtor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10

[Killed] BlockStatement
src/utils/CircuitBreaker.js:10:21
     this.state = 'CLOSED'; // CLOSED, OPEN, HALF-OPEN
   }
 
-  async execute(fn) {
-    if (this.state === 'OPEN') {
-      throw new Error('Circuit is open');
-    }
-
-    try {
-      const result = await fn();
-      return result;
-    } catch (error) {
-      // Aqui nas próximas fases você implementará a lógica de contagem de falhas
-      throw error;
-    }
-  }
+  async execute(fn) {}
 }
 
killedBy: CheckoutService Caminho Feliz - Pagamento Aprovado deve processar pedido com sucesso e enviar e-mail
statusReason: TypeError: Cannot read properties of null (reading 'status')

[Killed] EqualityOperator
src/utils/CircuitBreaker.js:11:9
   }
 
   async execute(fn) {
-    if (this.state === 'OPEN') {
+    if (this.state !== 'OPEN') {
       throw new Error('Circuit is open');
     }
killedBy: CheckoutService Caminho Feliz - Pagamento Aprovado deve processar pedido com sucesso e enviar e-mail
statusReason: TypeError: Cannot read properties of null (reading 'status')

[Killed] ConditionalExpression
src/utils/CircuitBreaker.js:11:9
   }
 
   async execute(fn) {
-    if (this.state === 'OPEN') {
+    if (false) {
       throw new Error('Circuit is open');
     }
killedBy: CheckoutService Circuit Breaker deve abrir o disjuntor após atingir os critérios de falha mínimos
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: 150, {"cvv": "123", "numero": "4111111111111111", "validade": "12/26"}

[Killed] StringLiteral
src/utils/CircuitBreaker.js:12:23
 
   async execute(fn) {
     if (this.state === 'OPEN') {
-      throw new Error('Circuit is open');
+      throw new Error("");
     }
 
killedBy: CheckoutService Circuit Breaker deve abrir o disjuntor após atingir os critérios de falha mínimos
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/utils/CircuitBreaker.js:15:9
       throw new Error('Circuit is open');
     }
 
-    try {
-      const result = await fn();
-      return result;
-    } catch (error) {
+    try {} catch (error) {
       // Aqui nas próximas fases você implementará a lógica de contagem de falhas
       throw error;
killedBy: CheckoutService Caminho Feliz - Pagamento Aprovado deve processar pedido com sucesso e enviar e-mail
statusReason: TypeError: Cannot read properties of null (reading 'status')

[Killed] BlockStatement
src/utils/CircuitBreaker.js:18:21
     try {
       const result = await fn();
       return result;
-    } catch (error) {
-      // Aqui nas próximas fases você implementará a lógica de contagem de falhas
-      throw error;
-    }
+    } catch (error) {}
   }
 }
killedBy: CheckoutService Resiliência - Timeout e Retry deve tentar novamente após timeout e recuperar na 2ª tentativa
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1
